<!DOCTYPE html SYSTEM "about:legacy-compat">
<html lang="en-US" data-preset="contrast" data-primary-color="#307FFF"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="UTF-8"><meta name="robots" content="noindex"><meta name="built-on" content="2024-04-03T22:11:55.291094906"><title>Maquettes (ou prototypes) | Help Instance</title><script type="application/json" id="virtual-toc-data">[{"id":"types-de-maquettes","level":0,"title":"Types de maquettes","anchor":"#types-de-maquettes"},{"id":"outils","level":0,"title":"Outils","anchor":"#outils"}]</script><script type="application/json" id="topic-shortcuts"></script><link href="https://resources.jetbrains.com/writerside/apidoc/6.6.6-b224/app.css" rel="stylesheet"><link rel="manifest" href="site.webmanifest"><meta name="msapplication-TileColor" content="#000000"><link rel="apple-touch-icon" sizes="180x180" href="https://jetbrains.com/apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="https://jetbrains.com/favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="https://jetbrains.com/favicon-16x16.png"><meta name="msapplication-TileImage" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-144x144.png"><meta name="msapplication-square70x70logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-70x70.png"><meta name="msapplication-square150x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-150x150.png"><meta name="msapplication-wide310x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x150.png"><meta name="msapplication-square310x310logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x310.png"><meta name="image" content=""><!-- Open Graph --><meta property="og:title" content="Maquettes (ou prototypes) | Help Instance"><meta property="og:description" content=""><meta property="og:image" content=""><meta property="og:site_name" content="Help Instance Help"><meta property="og:type" content="website"><meta property="og:locale" content="en_US"><meta property="og:url" content="writerside-documentation/maquettes.html"><!-- End Open Graph --><!-- Twitter Card --><meta name="twitter:card" content="summary_large_image"><meta name="twitter:site" content=""><meta name="twitter:title" content="Maquettes (ou prototypes) | Help Instance"><meta name="twitter:description" content=""><meta name="twitter:creator" content=""><meta name="twitter:image:src" content=""><!-- End Twitter Card --><!-- Schema.org WebPage --><script type="application/ld+json">{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "@id": "writerside-documentation/maquettes.html#webpage",
    "url": "writerside-documentation/maquettes.html",
    "name": "Maquettes (ou prototypes) | Help Instance",
    "description": "",
    "image": "",
    "inLanguage":"en-US"
}</script><!-- End Schema.org --><!-- Schema.org WebSite --><script type="application/ld+json">{
    "@type": "WebSite",
    "@id": "writerside-documentation/#website",
    "url": "writerside-documentation/",
    "name": "Help Instance Help"
}</script><!-- End Schema.org --></head><body data-id="Maquettes" data-main-title="Maquettes (ou prototypes)" data-article-props="{&quot;seeAlsoStyle&quot;:&quot;links&quot;}" data-template="article" data-breadcrumbs="Analyse-et-conception-architecturale.md|Analyse et conception architecturale///Prototypage.md|Prototypage"><div class="wrapper"><main class="panel _main"><header class="panel__header"><div class="container"><h3>Help Instance  Help</h3><div class="panel-trigger"></div></div></header><section class="panel__content"><div class="container"><article class="article" data-shortcut-switcher="inactive"><h1 data-toc="Maquettes" id="Maquettes.md">Maquettes (ou prototypes)</h1><section class="chapter"><h2 id="types-de-maquettes" data-toc="types-de-maquettes">Types de maquettes</h2><p id="-3m1nml_108">Lors de la conception d'un logiciel, divers types de maquettes (ou prototypes) peuvent &ecirc;tre utilis&eacute;s pour aider &agrave; visualiser et &agrave; tester diff&eacute;rentes facettes du syst&egrave;me. Voici quelques exemples :</p><ol class="list _decimal" id="-3m1nml_109" type="1"><li class="list__item" id="-3m1nml_110"><p id="-3m1nml_111"><span class="control" id="-3m1nml_112">Maquette statique</span>: La maquette la plus simple et la plus rapide &agrave; cr&eacute;er, souvent cr&eacute;&eacute;e avec du papier et un stylo ou un logiciel graphique. Elle sert &agrave; &eacute;tablir l'aspect g&eacute;n&eacute;ral et la disposition de l'interface utilisateur sans inclure de fonctionnalit&eacute;s interactives.</p></li><li class="list__item" id="-3m1nml_113"><p id="-3m1nml_114"><span class="control" id="-3m1nml_115">Maquette interactive</span>: Similaire &agrave; une maquette statique, mais avec des &eacute;l&eacute;ments interactifs. Cela permet aux utilisateurs de cliquer sur diff&eacute;rents &eacute;l&eacute;ments de l'interface utilisateur, g&eacute;n&eacute;ralement pour naviguer entre diff&eacute;rentes vues ou &eacute;crans.</p></li><li class="list__item" id="-3m1nml_116"><p id="-3m1nml_117"><span class="control" id="-3m1nml_118">Prototype horizontal</span>: Ce type de maquette montre une vue large de l'ensemble du syst&egrave;me, mais sans beaucoup de profondeur. Il est utile pour visualiser l'interface utilisateur &agrave; un haut niveau et pour comprendre le flux g&eacute;n&eacute;ral &agrave; travers le syst&egrave;me.</p></li><li class="list__item" id="-3m1nml_119"><p id="-3m1nml_120"><span class="control" id="-3m1nml_121">Prototype vertical</span>: Contrairement au prototype horizontal, le prototype vertical se concentre sur une petite portion du syst&egrave;me mais avec beaucoup de d&eacute;tails. Il est utile pour explorer en profondeur les fonctionnalit&eacute;s et les interactions sp&eacute;cifiques.</p></li><li class="list__item" id="-3m1nml_122"><p id="-3m1nml_123"><span class="control" id="-3m1nml_124">Maquette &agrave; haute fid&eacute;lit&eacute;</span>: Un prototype &agrave; haute fid&eacute;lit&eacute; est une version tr&egrave;s d&eacute;taill&eacute;e et interactive du logiciel. Il peut &ecirc;tre bas&eacute; sur le codage r&eacute;el et offrir une fonctionnalit&eacute; compl&egrave;te ou presque compl&egrave;te.</p></li><li class="list__item" id="-3m1nml_125"><p id="-3m1nml_126"><span class="control" id="-3m1nml_127">Maquette &agrave; faible fid&eacute;lit&eacute;</span>: Ces prototypes sont plus simplistes et ont souvent peu de simulation interactive. Ils sont utilis&eacute;s pour repr&eacute;senter rapidement des id&eacute;es et recevoir des commentaires t&ocirc;t dans le processus de conception.</p></li></ol><p id="-3m1nml_128">Chacun de ces types de maquettes a ses avantages et ses inconv&eacute;nients, et peut &ecirc;tre plus appropri&eacute; &agrave; diff&eacute;rents stades du processus de conception. G&eacute;n&eacute;ralement, il est pr&eacute;f&eacute;rable de commencer par des maquettes &agrave; faible fid&eacute;lit&eacute; et de progresser vers des maquettes &agrave; haute fid&eacute;lit&eacute; &agrave; mesure que le concept du logiciel se pr&eacute;cise.</p></section><section class="chapter"><h2 id="outils" data-toc="outils">Outils</h2><p id="-3m1nml_129">Il existe de nombreux outils que vous pouvez utiliser pour cr&eacute;er des maquettes de logiciel. Le choix de l'outil d&eacute;pendra de vos besoins sp&eacute;cifiques, tels que le niveau de d&eacute;tail que vous souhaitez, la facilit&eacute; d'utilisation, et combien vous &ecirc;tes pr&ecirc;t &agrave; d&eacute;penser. Voici quelques outils populaires :</p><ol class="list _decimal" id="-3m1nml_130" type="1"><li class="list__item" id="-3m1nml_131"><p id="-3m1nml_132"><span class="control" id="-3m1nml_133">Balsamiq</span>: C'est un excellent outil pour cr&eacute;er des maquettes &agrave; faible fid&eacute;lit&eacute; rapidement. Il a une interface utilisateur simplifi&eacute;e qui permet de cr&eacute;er des &eacute;crans en utilisant une vari&eacute;t&eacute; d'&eacute;l&eacute;ments d'interface utilisateur pr&eacute;fabriqu&eacute;s.</p></li><li class="list__item" id="-3m1nml_134"><p id="-3m1nml_135"><span class="control" id="-3m1nml_136">Sketch</span>: Un outil de design vectoriel pour macOS qui est excellent pour cr&eacute;er des maquettes &agrave; haute fid&eacute;lit&eacute;. Il offre une large gamme d'options de personnalisation pour les &eacute;l&eacute;ments d'interface utilisateur.</p></li><li class="list__item" id="-3m1nml_137"><p id="-3m1nml_138"><span class="control" id="-3m1nml_139">Adobe XD</span>: Il s'agit d'un outil de conception d'interface utilisateur qui permet aux concepteurs de cr&eacute;er des maquettes, des prototypages interactifs et des kits d'interface utilisateur. Il est disponible pour Windows et macOS.</p></li><li class="list__item" id="-3m1nml_140"><p id="-3m1nml_141"><span class="control" id="-3m1nml_142">Figma</span>: Un outil de conception d'interface utilisateur bas&eacute; sur le cloud qui permet de cr&eacute;er des maquettes &agrave; haute fid&eacute;lit&eacute; et de collaborer en temps r&eacute;el.</p></li><li class="list__item" id="-3m1nml_143"><p id="-3m1nml_144"><span class="control" id="-3m1nml_145">InVision</span>: Cet outil permet de cr&eacute;er des maquettes interactives &agrave; partir de vos designs. Il offre &eacute;galement des fonctionnalit&eacute;s de collaboration et de gestion des commentaires.</p></li><li class="list__item" id="-3m1nml_146"><p id="-3m1nml_147"><span class="control" id="-3m1nml_148">Axure RP</span>: C'est un outil de conception professionnel qui permet de cr&eacute;er des maquettes hautement interactives et dynamiques.</p></li><li class="list__item" id="-3m1nml_149"><p id="-3m1nml_150"><span class="control" id="-3m1nml_151">Marvel</span>: Un outil de conception d'interface utilisateur qui vous permet de cr&eacute;er des maquettes, des prototypes interactifs et des tests utilisateur.</p></li></ol><p id="-3m1nml_152">Ces outils offrent tous une gamme de fonctionnalit&eacute;s qui peuvent vous aider &agrave; concevoir et &agrave; pr&eacute;senter l'interface utilisateur et le flux d'utilisation de votre application logicielle avant de commencer le d&eacute;veloppement r&eacute;el.</p><section class="chapter"><h3 id="utilisations" data-toc="utilisations">Utilisations</h3><p id="-3m1nml_153">Tous les outils mentionn&eacute;s pr&eacute;c&eacute;demment, comme Balsamiq, Sketch, Adobe XD, Figma, InVision, Axure RP, et Marvel, peuvent &ecirc;tre utilis&eacute;s &agrave; la fois pour le prototypage jetable et &eacute;volutif. Le type de prototypage que vous choisirez d&eacute;pendra de votre processus de conception et de d&eacute;veloppement sp&eacute;cifique, ainsi que des besoins de votre projet.</p><p id="-3m1nml_154"><span class="control" id="-3m1nml_155">Prototypage jetable</span>: Balsamiq est souvent utilis&eacute; pour le prototypage jetable car il est facile &agrave; utiliser et permet de cr&eacute;er rapidement des maquettes &agrave; faible fid&eacute;lit&eacute;. Cela permet de pr&eacute;senter rapidement une id&eacute;e pour recueillir des commentaires et de jeter le mod&egrave;le ensuite.</p><p id="-3m1nml_156">Adobe XD, Sketch et Figma peuvent &eacute;galement &ecirc;tre utilis&eacute;s pour cr&eacute;er des maquettes plus d&eacute;taill&eacute;es &agrave; haute fid&eacute;lit&eacute;, qui sont ensuite jet&eacute;es et ne sont pas directement utilis&eacute;es dans le d&eacute;veloppement.</p><p id="-3m1nml_157"><span class="control" id="-3m1nml_158">Prototypage &eacute;volutif</span>: InVision, Figma, Adobe XD, Axure RP sont souvent utilis&eacute;s pour le prototypage &eacute;volutif. Ces outils offrent des fonctionnalit&eacute;s plus avanc&eacute;es pour la cr&eacute;ation de maquettes interactives &agrave; haute fid&eacute;lit&eacute;. Avec ces outils, vous pouvez continuer &agrave; affiner et &agrave; d&eacute;velopper vos maquettes en r&eacute;ponse aux commentaires des utilisateurs, et ceux-ci peuvent m&ecirc;me servir de base pour le d&eacute;veloppement de l'interface utilisateur finale.</p><p id="-3m1nml_159">Il est important de souligner que ces outils sont juste des moyens pour visualiser et tester des id&eacute;es pendant le processus de conception. Le code derri&egrave;re ces maquettes n'est g&eacute;n&eacute;ralement pas r&eacute;utilisable pour le produit final dans le d&eacute;veloppement de logiciels. L'id&eacute;e de prototypage &eacute;volutif dans ce contexte est plus sur l'&eacute;volution du design qu'une &eacute;volution du code du prototype vers le produit final.</p></section></section><div class="last-modified">Last modified: 04 avril 2024</div><div data-feedback-placeholder="true"></div><div class="navigation-links _bottom"><a href="prototypage.html" class="navigation-links__prev">Prototypage</a><a href="conception-detaillee.html" class="navigation-links__next">Conception d&eacute;taill&eacute;e</a></div></article><div id="disqus_thread"></div></div></section></main></div><script src="https://resources.jetbrains.com/writerside/apidoc/6.6.6-b224/app.js"></script></body></html>